HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxOvc_reg.h
/** \\brief  A8, Overlay Mask Register */
#define OVC2_BLK12_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FBA8u)

/** Alias (User Manual Name) for OVC2_BLK12_OMASK.
* To use register names with standard convension, please use OVC2_BLK12_OMASK.
*/
#define	OVC2_OMASK12	(OVC2_BLK12_OMASK)

/** \\brief  A4, Overlay Target Address Register */
#define OVC2_BLK12_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FBA4u)

/** Alias (User Manual Name) for OVC2_BLK12_OTAR.
* To use register names with standard convension, please use OVC2_BLK12_OTAR.
*/
#define	OVC2_OTAR12	(OVC2_BLK12_OTAR)

/** \\brief  A0, Redirected Address Base Register */
#define OVC2_BLK12_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FBA0u)

/** Alias (User Manual Name) for OVC2_BLK12_RABR.
* To use register names with standard convension, please use OVC2_BLK12_RABR.
*/
#define	OVC2_RABR12	(OVC2_BLK12_RABR)

/** \\brief  B4, Overlay Mask Register */
#define OVC2_BLK13_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FBB4u)

/** Alias (User Manual Name) for OVC2_BLK13_OMASK.
* To use register names with standard convension, please use OVC2_BLK13_OMASK.
*/
#define	OVC2_OMASK13	(OVC2_BLK13_OMASK)

/** \\brief  B0, Overlay Target Address Register */
#define OVC2_BLK13_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FBB0u)

/** Alias (User Manual Name) for OVC2_BLK13_OTAR.
* To use register names with standard convension, please use OVC2_BLK13_OTAR.
*/
#define	OVC2_OTAR13	(OVC2_BLK13_OTAR)

/** \\brief  AC, Redirected Address Base Register */
#define OVC2_BLK13_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FBACu)

/** Alias (User Manual Name) for OVC2_BLK13_RABR.
* To use register names with standard convension, please use OVC2_BLK13_RABR.
*/
#define	OVC2_RABR13	(OVC2_BLK13_RABR)

/** \\brief  C0, Overlay Mask Register */
#define OVC2_BLK14_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FBC0u)

/** Alias (User Manual Name) for OVC2_BLK14_OMASK.
* To use register names with standard convension, please use OVC2_BLK14_OMASK.
*/
#define	OVC2_OMASK14	(OVC2_BLK14_OMASK)

/** \\brief  BC, Overlay Target Address Register */
#define OVC2_BLK14_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FBBCu)

/** Alias (User Manual Name) for OVC2_BLK14_OTAR.
* To use register names with standard convension, please use OVC2_BLK14_OTAR.
*/
#define	OVC2_OTAR14	(OVC2_BLK14_OTAR)

/** \\brief  B8, Redirected Address Base Register */
#define OVC2_BLK14_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FBB8u)

/** Alias (User Manual Name) for OVC2_BLK14_RABR.
* To use register names with standard convension, please use OVC2_BLK14_RABR.
*/
#define	OVC2_RABR14	(OVC2_BLK14_RABR)

/** \\brief  CC, Overlay Mask Register */
#define OVC2_BLK15_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FBCCu)

/** Alias (User Manual Name) for OVC2_BLK15_OMASK.
* To use register names with standard convension, please use OVC2_BLK15_OMASK.
*/
#define	OVC2_OMASK15	(OVC2_BLK15_OMASK)

/** \\brief  C8, Overlay Target Address Register */
#define OVC2_BLK15_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FBC8u)

/** Alias (User Manual Name) for OVC2_BLK15_OTAR.
* To use register names with standard convension, please use OVC2_BLK15_OTAR.
*/
#define	OVC2_OTAR15	(OVC2_BLK15_OTAR)

/** \\brief  C4, Redirected Address Base Register */
#define OVC2_BLK15_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FBC4u)

/** Alias (User Manual Name) for OVC2_BLK15_RABR.
* To use register names with standard convension, please use OVC2_BLK15_RABR.
*/
#define	OVC2_RABR15	(OVC2_BLK15_RABR)

/** \\brief  D8, Overlay Mask Register */
#define OVC2_BLK16_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FBD8u)

/** Alias (User Manual Name) for OVC2_BLK16_OMASK.
* To use register names with standard convension, please use OVC2_BLK16_OMASK.
*/
#define	OVC2_OMASK16	(OVC2_BLK16_OMASK)

/** \\brief  D4, Overlay Target Address Register */
#define OVC2_BLK16_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FBD4u)

/** Alias (User Manual Name) for OVC2_BLK16_OTAR.
* To use register names with standard convension, please use OVC2_BLK16_OTAR.
*/
#define	OVC2_OTAR16	(OVC2_BLK16_OTAR)

/** \\brief  D0, Redirected Address Base Register */
#define OVC2_BLK16_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FBD0u)

/** Alias (User Manual Name) for OVC2_BLK16_RABR.
* To use register names with standard convension, please use OVC2_BLK16_RABR.
*/
#define	OVC2_RABR16	(OVC2_BLK16_RABR)

/** \\brief  E4, Overlay Mask Register */
#define OVC2_BLK17_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FBE4u)

/** Alias (User Manual Name) for OVC2_BLK17_OMASK.
* To use register names with standard convension, please use OVC2_BLK17_OMASK.
*/
#define	OVC2_OMASK17	(OVC2_BLK17_OMASK)

/** \\brief  E0, Overlay Target Address Register */
#define OVC2_BLK17_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FBE0u)

/** Alias (User Manual Name) for OVC2_BLK17_OTAR.
* To use register names with standard convension, please use OVC2_BLK17_OTAR.
*/
#define	OVC2_OTAR17	(OVC2_BLK17_OTAR)

/** \\brief  DC, Redirected Address Base Register */
#define OVC2_BLK17_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FBDCu)

/** Alias (User Manual Name) for OVC2_BLK17_RABR.
* To use register names with standard convension, please use OVC2_BLK17_RABR.
*/
#define	OVC2_RABR17	(OVC2_BLK17_RABR)

/** \\brief  F0, Overlay Mask Register */
#define OVC2_BLK18_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FBF0u)

/** Alias (User Manual Name) for OVC2_BLK18_OMASK.
* To use register names with standard convension, please use OVC2_BLK18_OMASK.
*/
#define	OVC2_OMASK18	(OVC2_BLK18_OMASK)

/** \\brief  EC, Overlay Target Address Register */
#define OVC2_BLK18_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FBECu)

/** Alias (User Manual Name) for OVC2_BLK18_OTAR.
* To use register names with standard convension, please use OVC2_BLK18_OTAR.
*/
#define	OVC2_OTAR18	(OVC2_BLK18_OTAR)

/** \\brief  E8, Redirected Address Base Register */
#define OVC2_BLK18_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FBE8u)

/** Alias (User Manual Name) for OVC2_BLK18_RABR.
* To use register names with standard convension, please use OVC2_BLK18_RABR.
*/
#define	OVC2_RABR18	(OVC2_BLK18_RABR)

