HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxOvc_reg.h
/** \\brief  140, Overlay Target Address Register */
#define OVC2_BLK25_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FC40u)

/** Alias (User Manual Name) for OVC2_BLK25_OTAR.
* To use register names with standard convension, please use OVC2_BLK25_OTAR.
*/
#define	OVC2_OTAR25	(OVC2_BLK25_OTAR)

/** \\brief  13C, Redirected Address Base Register */
#define OVC2_BLK25_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FC3Cu)

/** Alias (User Manual Name) for OVC2_BLK25_RABR.
* To use register names with standard convension, please use OVC2_BLK25_RABR.
*/
#define	OVC2_RABR25	(OVC2_BLK25_RABR)

/** \\brief  150, Overlay Mask Register */
#define OVC2_BLK26_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FC50u)

/** Alias (User Manual Name) for OVC2_BLK26_OMASK.
* To use register names with standard convension, please use OVC2_BLK26_OMASK.
*/
#define	OVC2_OMASK26	(OVC2_BLK26_OMASK)

/** \\brief  14C, Overlay Target Address Register */
#define OVC2_BLK26_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FC4Cu)

/** Alias (User Manual Name) for OVC2_BLK26_OTAR.
* To use register names with standard convension, please use OVC2_BLK26_OTAR.
*/
#define	OVC2_OTAR26	(OVC2_BLK26_OTAR)

/** \\brief  148, Redirected Address Base Register */
#define OVC2_BLK26_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FC48u)

/** Alias (User Manual Name) for OVC2_BLK26_RABR.
* To use register names with standard convension, please use OVC2_BLK26_RABR.
*/
#define	OVC2_RABR26	(OVC2_BLK26_RABR)

/** \\brief  15C, Overlay Mask Register */
#define OVC2_BLK27_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FC5Cu)

/** Alias (User Manual Name) for OVC2_BLK27_OMASK.
* To use register names with standard convension, please use OVC2_BLK27_OMASK.
*/
#define	OVC2_OMASK27	(OVC2_BLK27_OMASK)

/** \\brief  158, Overlay Target Address Register */
#define OVC2_BLK27_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FC58u)

/** Alias (User Manual Name) for OVC2_BLK27_OTAR.
* To use register names with standard convension, please use OVC2_BLK27_OTAR.
*/
#define	OVC2_OTAR27	(OVC2_BLK27_OTAR)

/** \\brief  154, Redirected Address Base Register */
#define OVC2_BLK27_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FC54u)

/** Alias (User Manual Name) for OVC2_BLK27_RABR.
* To use register names with standard convension, please use OVC2_BLK27_RABR.
*/
#define	OVC2_RABR27	(OVC2_BLK27_RABR)

/** \\brief  168, Overlay Mask Register */
#define OVC2_BLK28_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FC68u)

/** Alias (User Manual Name) for OVC2_BLK28_OMASK.
* To use register names with standard convension, please use OVC2_BLK28_OMASK.
*/
#define	OVC2_OMASK28	(OVC2_BLK28_OMASK)

/** \\brief  164, Overlay Target Address Register */
#define OVC2_BLK28_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FC64u)

/** Alias (User Manual Name) for OVC2_BLK28_OTAR.
* To use register names with standard convension, please use OVC2_BLK28_OTAR.
*/
#define	OVC2_OTAR28	(OVC2_BLK28_OTAR)

/** \\brief  160, Redirected Address Base Register */
#define OVC2_BLK28_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FC60u)

/** Alias (User Manual Name) for OVC2_BLK28_RABR.
* To use register names with standard convension, please use OVC2_BLK28_RABR.
*/
#define	OVC2_RABR28	(OVC2_BLK28_RABR)

/** \\brief  174, Overlay Mask Register */
#define OVC2_BLK29_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FC74u)

/** Alias (User Manual Name) for OVC2_BLK29_OMASK.
* To use register names with standard convension, please use OVC2_BLK29_OMASK.
*/
#define	OVC2_OMASK29	(OVC2_BLK29_OMASK)

/** \\brief  170, Overlay Target Address Register */
#define OVC2_BLK29_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FC70u)

/** Alias (User Manual Name) for OVC2_BLK29_OTAR.
* To use register names with standard convension, please use OVC2_BLK29_OTAR.
*/
#define	OVC2_OTAR29	(OVC2_BLK29_OTAR)

/** \\brief  16C, Redirected Address Base Register */
#define OVC2_BLK29_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FC6Cu)

/** Alias (User Manual Name) for OVC2_BLK29_RABR.
* To use register names with standard convension, please use OVC2_BLK29_RABR.
*/
#define	OVC2_RABR29	(OVC2_BLK29_RABR)

/** \\brief  30, Overlay Mask Register */
#define OVC2_BLK2_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FB30u)

/** Alias (User Manual Name) for OVC2_BLK2_OMASK.
* To use register names with standard convension, please use OVC2_BLK2_OMASK.
*/
#define	OVC2_OMASK2	(OVC2_BLK2_OMASK)

/** \\brief  2C, Overlay Target Address Register */
#define OVC2_BLK2_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FB2Cu)

/** Alias (User Manual Name) for OVC2_BLK2_OTAR.
* To use register names with standard convension, please use OVC2_BLK2_OTAR.
*/
#define	OVC2_OTAR2	(OVC2_BLK2_OTAR)

/** \\brief  28, Redirected Address Base Register */
#define OVC2_BLK2_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FB28u)

/** Alias (User Manual Name) for OVC2_BLK2_RABR.
* To use register names with standard convension, please use OVC2_BLK2_RABR.
*/
#define	OVC2_RABR2	(OVC2_BLK2_RABR)

/** \\brief  180, Overlay Mask Register */
#define OVC2_BLK30_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FC80u)

/** Alias (User Manual Name) for OVC2_BLK30_OMASK.
* To use register names with standard convension, please use OVC2_BLK30_OMASK.
*/
#define	OVC2_OMASK30	(OVC2_BLK30_OMASK)

/** \\brief  17C, Overlay Target Address Register */
#define OVC2_BLK30_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FC7Cu)

/** Alias (User Manual Name) for OVC2_BLK30_OTAR.
* To use register names with standard convension, please use OVC2_BLK30_OTAR.
*/
#define	OVC2_OTAR30	(OVC2_BLK30_OTAR)

/** \\brief  178, Redirected Address Base Register */
#define OVC2_BLK30_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FC78u)

/** Alias (User Manual Name) for OVC2_BLK30_RABR.
* To use register names with standard convension, please use OVC2_BLK30_RABR.
*/
#define	OVC2_RABR30	(OVC2_BLK30_RABR)

/** \\brief  18C, Overlay Mask Register */
#define OVC2_BLK31_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FC8Cu)

/** Alias (User Manual Name) for OVC2_BLK31_OMASK.
* To use register names with standard convension, please use OVC2_BLK31_OMASK.
*/
#define	OVC2_OMASK31	(OVC2_BLK31_OMASK)

/** \\brief  188, Overlay Target Address Register */
#define OVC2_BLK31_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FC88u)

